app/views/movies/show.html.erb


	<% if @movie.recent_reviews.any? %>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 5]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 7]]