app/controllers/movies_controller.rb

  def destroy
    # redirect_to movies_url, danger: "I'm sorry, Dave, I'm afraid I can't do that."
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 8]]