app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 13], ["id", 1]]
---
  def show
    @review = @movie.reviews.find(params[:id])

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 23]]
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 13], ["id", 23]]
---
  def destroy
    @movie.reviews.find(params[:id]).destroy

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 13], ["id", 15]]
UPDATE "reviews" SET "comment" = ?, "name" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["comment", "\nI laughed, I cried, I spilled my popcorn!"], ["name", "Updated Review Name"], ["updated_at", "2015-04-29 11:42:38.030720"]]
---
  def update
    @review = @movie.reviews.find(params[:id])
    if @review.update(review_params)