app/views/reviews/show.html.erb

  <nav>
		<%= link_to pluralize(@movie.reviews.size, 'review'), movie_reviews_path(@movie), class: 'button' %>
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 2], ["id", 5]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 13]]